import random
import telebot
import time
import threading

bot = telebot.TeleBot("YOUR TOKEN")



@bot.message_handler(commands=["start", "main"])
def start(msg):
    messah = f'{msg.from_user.first_name}, вітаю в телеграм чат-боті "Правда чи Дія". Для детальної інформації введіть /help'
    bot.reply_to(msg, messah, parse_mode = "html")

@bot.message_handler(commands=["help"])
def help(msg):
	bot.reply_to(msg, f"Правила надзвичайно прості: по черзі обираєте правду або дію (не більше 3 разів обирати те саме), вводите команду потрібної дії та граєте!\n\n<b>Мої команди:\n/dia</b> - бот рандомно обирає дію для Вас\n<b>/pravda</b> - бот рандомно обирає запитання для Вас\n<b>/help - детальна інформація</b>\n\n\n\n\n\n\n<b>Мій творець - <a href='https://t.me/workshopbots'>Bots' WorkShop</a>\n\nВерсія бота: 0.3</b>", parse_mode="html")

@bot.message_handler(commands=["dia"])
def dia(msg):
	dialist = ["Змінити аватарку на аватарку @7 або 7 з ваших переписок",  "Подаруй свій steam акаунт @lopez1k ", "Змінити опис на опис @7 або 7 з ваших переписок", "Прочитай перші 7 рядків 'Заповіт' Т.Шевченка у голосове повідомлення", "Постав собі у опис 4 текст, який тобі видасть сайт під пошуком 'Ауф цитати'", "Відправ недавньо відправлену GIF", "Зміни свою аватарку на зображення своєї улюбленої тварини протягом 24 годин","Зміни своє ім'я в профілі на ім'я своєї улюбленої літературної або кінематографічної персонажки наступний тиждень","Запостіть голосове повідомлення, в якому ви читаєте вірш про дружбу або кохання, написаний вами або знайдений в Інтернеті","Постав фото з відомою локацією міста або країни як аватарку та залишай її протягом тижня","Зміни свій статус на відображення цитати з твоєї улюбленої книги або фільму наступні 48 годин","Зміни колір теми свого Telegram на випадковий колір, який вказує бот, та залишай його протягом дня","Запиши голосове повідомлення, у якому розповідаєш про свої улюблені книги, фільми або хобі, і поділись цим з друзями в чаті","Зміни своє ім'я в профілі на вигадане прізвисько та підкажи, звідки воно походить",     "Зміни шрифт своїх повідомлень на курсив та користуйся ним весь день.",
    "Знайди мем або гіфку, яка тобі сподобалась, та поділись нею у чаті.",
    "Розповісь друзям про свій улюблений рецепт та надішли його в чаті.",
    "Подаруй свій steam акаунт @lopez1k ",
    "Подаруй свій steam акаунт @lopez1k ",
    "Подаруй свій steam акаунт @lopez1k ",
    "Подаруй свій steam акаунт @lopez1k ",
    "Зміни налаштування звуку повідомлень на Telegram та працюй з новим звуком протягом дня.",
    "Придумай свій унікальний емоджі та надішли його в чат.",
    "Знайди дуже веселу або цікаву історію з Інтернету та поділись нею зі своїми друзями.",
    "Запроси своїх друзів до твого чат-бота та проведи з ними веселу онлайн гру.",
    "Запиши відео, як ти танцюєш під свою улюблену пісню, та поділись ним в чаті.",
    "Підбери вірш або пісню, яка описує твій стан душі зараз, та надішли текст в чат.",
    "Запостіть фото своєї улюбленої страви чи десерту та поділись рецептом з друзями.",
    "Зміни звуковий сигнал на один звук повідомлень на Telegram на весь наступний день.",
    "Придумай веселий лозунг чи девіз для своєї сторінки у Telegram та надішли його в чат.",
    "Запостіть фото твоєї найулюбленішої книги та розкажи, чому вона така особлива для тебе.",
    "Зміни свій статус на привітання 'З Днем Народження!' та залишай його протягом дня.",
    "Розкажи про своє найсмішнішу життєву пригоду та поділись нею зі своїми друзями.",
    "Знайди цікавий маршрут у своєму місті, який ти ще не проходив, та розкажи про нього друзям.",
    "Запиши голосове повідомлення, у якому звітуєш про найцікавішу зустріч дня.",
    "Зміни кольорову схему додатку Telegram на свій вибір та користуйся таким протягом дня.",
    "Запиши голосове повідомлення, в якому розповідаєш свою найбільшу фантазію.",
    "Придумай своє власне мото для життя та поділись ним у чаті.",
    "Зміни зображення фону чату на своє фото зі світлинами улюблених моментів.",
    "Запроси друзів на тематичну вечірку або зібрання через свій Telegram-чат.",
    "Постав свою улюблену пісню на дзвінок повідомлень на весь наступний день.",
    "Запостіть фото твоєї улюбленої пейзажної картини та поділись своїми враженнями про неї.",
    "Придумай свою власну загадку та поділись нею з друзями в чаті.",
    "Зміни свою аватарку на фото з дитинства та залишай її протягом дня.",
    "Запиши голосове повідомлення, в якому розповідаєш про свій найбільш незвичайний сніданок.",
    "Зміни налаштування розміру шрифту у додатку Telegram та працюй з новим розміром протягом дня.",
    "Розкажи друзям про свою улюблену фразу або крилате висловлювання та надішли її в чат.",
    "Запостіть фото або відео своєї улюбленої гри чи хобі та поділись ним з друзями."
]


	dia = random.choice(dialist)
	messahdi = f" Черга дійшла до @{msg.from_user.username} | {msg.from_user.first_name}\n\n<b>Завдання:</b> {dia}\n\n\n<b>Мій творець - <a href = 'https://t.me/workshopbots'>Bots' WorkShop</a></b>"
	bot.reply_to(msg, messahdi, parse_mode = "html")

@bot.message_handler(commands=["dropdick"])
def pencil (msg):
    bot.reply_to(msg, f'@{msg.from_user.username}, твій песюн відрізано\nТепер його довжина: 0 см.', parse_mode="html")
@bot.message_handler(commands=["pravda"])
def pravda (msg):
     pravdalist = ["Які ваші улюблені хобі?", "Що вас найбільше надихає?", "Як ви проводите свій вільний час?", "Які книжки ви останнім часом прочитали?", "Яку музику ви слухаєте?", "Які ваші мети та амбіції?",  "Які країни ви мрієте відвідати?", "Який ваш улюблений фільм або телесеріал?", "Що ви робите, щоб підтримувати своє здоров'я?",   "Як ви боретесь зі стресом?", "Які ваші улюблені страви?", "Які ваші переконання та цінності?", "Чим ви пишаєтесь у своєму житті?",  "Які навички ви хотіли б розвинути?",  "Які сфери знань вас найбільше зацікавлюють?", "Як ви визначаєте успіх?",  "Що ви можете розповісти про свою сім'ю?", "Які події вплинули на ваше життя найбільше?", "Що ви хочете досягти в найближчі 5 років?",  "Як ви уявляєте своє ідеальне життя?", "Які ваші найбільші страхи та як ви з ними впораєтесь?", "Що для вас означає кохання та як ви виражаєте свої почуття?", "Які події з вашого минулого сильно вплинули на вас і ваші уявлення про світ?", "Як ви дізналися про свої найглибші переконання та як вони формують ваші дії?", "Що ви вважаєте своїм найбільшим недоліком і як ви намагаєтеся над ним працювати?", "Які ваші улюблені способи вираження та виразу себе (наприклад, малювання, письмо, музика)?", "Які ситуації або моменти в житті вам найбільше тривожлять і чому?", "Як ви ставитеся до ідеї прощення і чи були випадки, коли вам довелося прощати кого-небудь?", "Як ви впораєтесь із складними рішеннями та важкими життєвими ситуаціями?",
     "Як ви відноситеся до самооцінки та як це впливає на ваше самопочуття?"]
     pravda = random.choice(pravdalist)
     messahpr = f" Черга дійшла до @{msg.from_user.username} | {msg.from_user.first_name}\n\n<b>Завдання:</b> {pravda}\n\n\n<b>Мій творець - <a href = 'https://t.me/workshopbots'>Bots' WorkShop</a></b>"
     bot.reply_to(msg, messahpr, parse_mode = "html")


bot.polling(non_stop=True)
